/**
 * Задача №1
 * разработать приложение для управления библиотекой. В библиотеке хранятся книги, каждая из которых имеет
 * название, автора и статус (доступна для выдачи или выдана читателю). Нужно реализовать класс, который будет:
 *
 * 1. Добавлять новые книги в библиотеку.
 * 2. Искать книгу по названию и выводить её статус (доступна или выдана).
 * 3. Выдавать книгу читателю (менять статус книги на "выдана").
 * 4. Возвращать книгу в библиотеку (менять статус книги на "доступна").
 * 5. Показать все книги, доступные для выдачи.
 */